{
  "career": [
    {
      "name": "Master Team",
      "href": "https://www.masterteam.sa/",
      "title": "Sr. IT Business Consultant",
      "logo": "/masterteam.jpg",
      "start": "May 2025",
      "end": "Present",
      "description": [
        "Led enterprise-wide consulting engagements, delivering tailored digital solutions across healthcare, government, and finance sectors.",
        "Designed and institutionalized a Business Consultant Framework that enhanced delivery consistency across 15+ client software products.",
        "Directed the implementation of over 10 cross-entity systems by aligning business strategy with technical execution and policy compliance."
      ]
    },
    {
      "name": "Cloud Solutions",
      "href": "https://cloudsolutions.com.sa/en/",
      "title": "IT Business Analyst | Product Owner",
      "logo": "/cloudsolutions.png",
      "start": "Sep 2023",
      "end": "May 2025",
      "description": [
        "Streamlined business requirements gathering, producing over 1,200 pages of documentation and reducing project delivery time by 70%.",
        "Implemented a reporting framework with Microsoft Power Platforms, creating over 100 dashboards to enable data-driven decisions.",
        "Developed a Business Analyst training program, increasing team efficiency and skill development."
      ]
    },
    {
      "name": "Pixelated",
      "href": "https://www.pixilated.online/",
      "title": "IT Senior Business Analyst & BI Developer",
      "logo": "/Pixilated.png",
      "start": "Jan 2021",
      "end": "Sep 2023",
      "description": [
        "Launched a tailored training program for analysts, strengthening team capabilities in BI and operations.",
        "Improved data accuracy and consistency in reporting by implementing standardized documentation practices.",
        "Facilitated Fintech regular workshops for stakeholders, fostering a data-driven culture and enhancing project buy-in."
      ]
    },
    {
      "name": "Council of Engineers Association",
      "href": "https://www.jea.org.jo/Default/En",
      "title": "Data Scientist (Contract)",
      "logo": "/coa.png",
      "start": "July 2020",
      "end": "Jan 2021",
      "description": [
        "Conducted advanced data analysis and developed predictive models, providing actionable insights for key engineering projects.",
        "Created visualizations and dashboards that translated complex data into clear, actionable insights to support decision-making.",
        "Authored technical documentation for data models and algorithms, ensuring reproducibility and knowledge sharing across teams."
      ]
    },
    {
      "name": "Digital Cash",
      "href": "https://dg-cash.com/",
      "title": "Software Data Scientist",
      "logo": "/digitalcash.png",
      "start": "Jun 2019",
      "end": "July 2020",
      "description": [
        "Built and deployed an application focusing on RESTful services with Spring Boot in an agile setting.",
        "Developed data pipelines for large datasets, optimizing data flow and integration.",
        "Extracted insights from application data to drive improvements and support business objectives."
      ]
    }
  ]
}
